{
  "games": [
    {
      "name": "Slope",
      "slug": "slope",
      "type": "html",
      "url": "data/games/slope/index.html",
      "thumb": "data/thumbs/slope.png",
      "description": "Slope is a fun endless running game created by RobKayS. Guide a rolling ball down a steep, neon-lit slope while avoiding obstacles and staying on the platform. Be careful – if you hit a red block or fall off the edge, it's game over!",
      "controls": "Arrow Keys or A/D - Steer left and right",
      "instructions": "Don't be afraid to make small adjustments rather than sharp turns to maintain control.\nUse anticipation skills to look ahead and plan your path before obstacles appear!",
      "creator": "Slope is created by RobKayS, known for developing addictive skill-based arcade games with minimalist design.",
      "category": "Action"
    },
    {
      "name": "Run 3",
      "slug": "run-3",
      "type": "html",
      "url": "data/games/run-3/index.html",
      "thumb": "data/thumbs/run3.png",
      "description": "Run 3 is a fun endless runner game created by Player 03. Navigate through space tunnels by running and jumping while gravity shifts around you. Be careful – if you fall into the void or hit obstacles, you'll have to restart!",
      "controls": "Arrow Keys or WASD - Move and jump\nSpace - Jump",
      "instructions": "Don't be afraid to use the walls and ceiling as the floor when gravity shifts.\nUse the different characters you've unlocked – each has unique abilities that help in specific tunnel types!",
      "creator": "Run 3 is created by Player 03, known for developing the popular Run series with innovative gravity-based mechanics.",
      "category": "Action"
    },
    {
      "name": "Super Mario Flash",
      "slug": "super-mario-flash",
      "type": "swf",
      "url": "data/games/super-mario-flash/super-mario-flash.swf",
      "thumb": "data/thumbs/super-mario-flash.png",
      "description": "Super Mario Flash is a fun platformer game created by Pouetpu. Play through classic Mario-style levels or create your own using the built-in level editor. Be careful – if you fall into pits or get hit by enemies too many times, you'll lose a life!",
      "controls": "Arrow Keys - Move\nShift or A - Jump\nCtrl or S - Run/Shoot fireballs",
      "instructions": "Don't be afraid to explore levels thoroughly for hidden power-ups and secret areas.\nUse the level editor to create and share your own custom Mario challenges!",
      "creator": "Super Mario Flash is created by Pouetpu, a fan developer who created this beloved Flash tribute to Nintendo's Super Mario series.",
      "category": "Platformer"
    },
    {
      "name": "Retro Bowl",
      "slug": "retro-bowl",
      "type": "html",
      "url": "data/games/retro-bowl/index.html",
      "thumb": "data/thumbs/retrobowl.png",
      "description": "Retro Bowl is a fun American football game created by New Star Games. Manage your team and lead them to championship glory with strategic plays and precise throws. Be careful – if you make too many incomplete passes or bad decisions, you'll lose the game!",
      "controls": "Mouse - Aim and throw passes\nClick - Select plays and make decisions\nWASD - Control player movement",
      "instructions": "Don't be afraid to invest in your offense early – a strong receiving corps wins games.\nUse the play-calling strategy you've learned to read defenses and exploit mismatches!",
      "creator": "Retro Bowl is created by New Star Games, known for developing engaging sports management games with retro aesthetics.",
      "category": "Sports"
    },
    {
      "name": "Bloons Tower Defense 4",
      "slug": "bloons-td-4",
      "type": "swf",
      "url": "data/games/bloons-td-4/bloonstd4.swf",
      "thumb": "data/thumbs/bloons-td-4.png",
      "description": "Bloons Tower Defense 4 is a fun tower defense game created by Ninja Kiwi. Strategically place monkey towers along the path to pop waves of colorful bloons before they escape. Be careful – if too many bloons get through, you'll lose lives and fail the level!",
      "controls": "Mouse - Select and place towers\nClick - Upgrade towers and activate abilities",
      "instructions": "Don't be afraid to save money for crucial upgrades rather than placing too many weak towers.\nUse tower combinations to handle different bloon types effectively, especially tough MOAB-class bloons!",
      "creator": "Bloons Tower Defense 4 is created by Ninja Kiwi, a New Zealand-based game developer famous for the beloved Bloons franchise.",
      "category": "Tower Defense"
    },
    {
      "name": "1v1.LOL",
      "slug": "1v1-lol",
      "type": "html",
      "url": "https://1v1-lolunblocked.gitlab.io/file/",
      "thumb": "data/thumbs/1v1-lol.png",
      "description": "1v1.lol is a fun building and shooting game created by JustPlay.LOL. Battle opponents in fast-paced 1v1 matches where you can build structures and eliminate enemies. Be careful – if your opponent builds faster or shoots more accurately, you'll be eliminated!",
      "controls": "WASD - Move\nLeft Click - Shoot\nRight Click - Aim\nQ/C/V/B - Build structures\nSpace - Jump",
      "instructions": "Don't be afraid to practice building muscle memory in the training mode first.\nUse the high ground advantage gained through building to get better shooting angles on opponents!",
      "creator": "1v1.lol is created by JustPlay.LOL, known for developing competitive multiplayer games with building mechanics.",
      "category": "Shooter"
    },
    {
      "name": "Snake",
      "slug": "snake",
      "type": "html",
      "url": "https://www.google.com/fbx?fbx=snake_arcade&fbxga=1&hl=en&origin=www.google.com",
      "thumb": "data/thumbs/snake.png",
      "description": "Snake is a fun classic arcade game. Control a growing snake and eat food to increase your length while avoiding walls and your own tail. Be careful – if you crash into yourself or the boundaries, it's game over!",
      "controls": "Arrow Keys or WASD - Change direction",
      "instructions": "Don't be afraid to follow the edges of the screen to create more space in the center.\nUse a spiral pattern to safely navigate as your snake grows longer!",
      "creator": "Snake is a classic game concept originally created by Gremlin Industries, reimagined in countless versions across gaming history.",
      "category": "Classic"
    }
  ]
}