{
  "games": [
    {
      "name": "Slope",
      "slug": "slope",
      "type": "html",
      "url": "data/games/slope/index.html",
      "thumb": "data/thumbs/slope.png",
      "description": "Slope is a fun endless running game created by RobKayS. Guide a rolling ball down a steep, neon-lit slope while avoiding obstacles and staying on the platform. Be careful – if you hit a red block or fall off the edge, it's game over!",
      "controls": "Arrow Keys or A/D - Steer left and right",
      "instructions": "Don't be afraid to make small adjustments rather than sharp turns to maintain control.\nUse anticipation skills to look ahead and plan your path before obstacles appear!",
      "creator": "Slope is created by RobKayS, known for developing addictive skill-based arcade games with minimalist design.",
      "category": "Action"
    },
    {
      "name": "Run 3",
      "slug": "run-3",
      "type": "html",
      "url": "data/games/run-3/index.html",
      "thumb": "data/thumbs/run3.png",
      "description": "Run 3 is a fun endless runner game created by Player 03. Navigate through space tunnels by running and jumping while gravity shifts around you. Be careful – if you fall into the void or hit obstacles, you'll have to restart!",
      "controls": "Arrow Keys or WASD - Move and jump\nSpace - Jump",
      "instructions": "Don't be afraid to use the walls and ceiling as the floor when gravity shifts.\nUse the different characters you've unlocked – each has unique abilities that help in specific tunnel types!",
      "creator": "Run 3 is created by Player 03, known for developing the popular Run series with innovative gravity-based mechanics.",
      "category": "Action"
    },
    {
      "name": "Super Mario Flash",
      "slug": "super-mario-flash",
      "type": "swf",
      "url": "data/games/super-mario-flash/super-mario-flash.swf",
      "thumb": "data/thumbs/super-mario-flash.png",
      "description": "Super Mario Flash is a fun platformer game created by Pouetpu. Play through classic Mario-style levels or create your own using the built-in level editor. Be careful – if you fall into pits or get hit by enemies too many times, you'll lose a life!",
      "controls": "Arrow Keys - Move\nShift or A - Jump\nCtrl or S - Run/Shoot fireballs",
      "instructions": "Don't be afraid to explore levels thoroughly for hidden power-ups and secret areas.\nUse the level editor to create and share your own custom Mario challenges!",
      "creator": "Super Mario Flash is created by Pouetpu, a fan developer who created this beloved Flash tribute to Nintendo's Super Mario series.",
      "category": "Platformer"
    },
    {
      "name": "Retro Bowl",
      "slug": "retro-bowl",
      "type": "html",
      "url": "data/games/retro-bowl/index.html",
      "thumb": "data/thumbs/retrobowl.png",
      "description": "Retro Bowl is a fun American football game created by New Star Games. Manage your team and lead them to championship glory with strategic plays and precise throws. Be careful – if you make too many incomplete passes or bad decisions, you'll lose the game!",
      "controls": "Mouse - Aim and throw passes\nClick - Select plays and make decisions\nWASD - Control player movement",
      "instructions": "Don't be afraid to invest in your offense early – a strong receiving corps wins games.\nUse the play-calling strategy you've learned to read defenses and exploit mismatches!",
      "creator": "Retro Bowl is created by New Star Games, known for developing engaging sports management games with retro aesthetics.",
      "category": "Sports"
    },
    {
      "name": "Bloons Tower Defense 4",
      "slug": "bloons-td-4",
      "type": "swf",
      "url": "data/games/bloons-td-4/bloonstd4.swf",
      "thumb": "data/thumbs/bloons-td-4.png",
      "description": "Bloons Tower Defense 4 is a fun tower defense game created by Ninja Kiwi. Strategically place monkey towers along the path to pop waves of colorful bloons before they escape. Be careful – if too many bloons get through, you'll lose lives and fail the level!",
      "controls": "Mouse - Select and place towers\nClick - Upgrade towers and activate abilities",
      "instructions": "Don't be afraid to save money for crucial upgrades rather than placing too many weak towers.\nUse tower combinations to handle different bloon types effectively, especially tough MOAB-class bloons!",
      "creator": "Bloons Tower Defense 4 is created by Ninja Kiwi, a New Zealand-based game developer famous for the beloved Bloons franchise.",
      "category": "Tower Defense"
    },
    {
      "name": "1v1.LOL",
      "slug": "1v1-lol",
      "type": "html",
      "url": "https://1v1-lolunblocked.gitlab.io/file/",
      "thumb": "data/thumbs/1v1-lol.png",
      "description": "1v1.lol is a fun building and shooting game created by JustPlay.LOL. Battle opponents in fast-paced 1v1 matches where you can build structures and eliminate enemies. Be careful – if your opponent builds faster or shoots more accurately, you'll be eliminated!",
      "controls": "WASD - Move\nLeft Click - Shoot\nRight Click - Aim\nQ/C/V/B - Build structures\nSpace - Jump",
      "instructions": "Don't be afraid to practice building muscle memory in the training mode first.\nUse the high ground advantage gained through building to get better shooting angles on opponents!",
      "creator": "1v1.lol is created by JustPlay.LOL, known for developing competitive multiplayer games with building mechanics.",
      "category": "Shooter"
    },
    {
      "name": "Snake",
      "slug": "snake",
      "type": "html",
      "url": "https://www.google.com/fbx?fbx=snake_arcade&fbxga=1&hl=en&origin=www.google.com",
      "thumb": "data/thumbs/snake.png",
      "description": "Snake is a fun classic arcade game. Control a growing snake and eat food to increase your length while avoiding walls and your own tail. Be careful – if you crash into yourself or the boundaries, it's game over!",
      "controls": "Arrow Keys or WASD - Change direction",
      "instructions": "Don't be afraid to follow the edges of the screen to create more space in the center.\nUse a spiral pattern to safely navigate as your snake grows longer!",
      "creator": "Snake is a classic game concept originally created by Gremlin Industries, reimagined in countless versions across gaming history.",
      "category": "Classic"
    },
  {
    "name": "3 Pandas In Japan",
    "slug": "3-pandas-in-japan",
    "type": "html",
    "url": "https://ubg98.github.io/3PandasInJapan/",
    "thumb": "data/thumbs/3-pandas-in-japan.png",
    "description": "3 Pandas In Japan is a fun puzzle adventure game created by FlashTeam. Guide three adorable pandas through Japan as they solve puzzles and avoid capture by using their unique abilities. Be careful – if you make the wrong choice or miss a step, the pandas could get caught!",
    "controls": "Mouse - Click on pandas and objects to interact. Click - Use each panda's special ability to solve puzzles",
    "instructions": "Don't be afraid to experiment with different pandas and objects to find the solution. Use the unique abilities you've discovered – each panda has special skills that are crucial for specific puzzles!",
    "creator": "FlashTeam",
    "category": "Puzzle"
  },
  {
    "name": "Adam And Eve 7",
    "slug": "adam-and-eve-7",
    "type": "html",
    "url": "https://ubg98.github.io/AdamAndEve7/",
    "thumb": "data/thumbs/adam-and-eve-7.png",
    "description": "Adam And Eve 7 is a fun puzzle adventure game created by Functu. Help Adam navigate through prehistoric landscapes and solve clever puzzles to find his true love, Eve. Be careful – if you interact with objects in the wrong order, you'll get stuck and need to rethink your approach!",
    "controls": "Mouse - Click on objects and characters to interact. Click - Solve puzzles by using items in the correct sequence",
    "instructions": "Don't be afraid to click on everything in the scene to discover hidden interactions. Use the pattern recognition you've developed from previous levels – solutions often follow logical sequences!",
    "creator": "Functu",
    "category": "Puzzle"
  },
  {
    "name": "Boxing Random",
    "slug": "boxing-random",
    "type": "html",
    "url": "https://ubg98.github.io/BoxingRandom/",
    "thumb": "data/thumbs/boxing-random.png",
    "description": "Boxing Random is a fun physics-based boxing game created by RHM Interactive. Throw punches and knock out your opponent in hilarious ragdoll boxing matches with randomly changing conditions. Be careful – if your opponent lands a knockout punch first, you'll hit the canvas!",
    "controls": "Player 1: W - Punch. Player 2: Up Arrow - Punch. (Single player mode available against CPU)",
    "instructions": "Don't be afraid to wait for the right moment rather than throwing wild punches constantly. Use the physics changes you've observed to adapt your strategy – ice floors, low gravity, and different gloves all require different approaches!",
    "creator": "RHM Interactive",
    "category": "Sports"
  },
  {
    "name": "Cookie Clicker 2",
    "slug": "cookie-clicker-2",
    "type": "html",
    "url": "https://ubg98.github.io/CookieClicker2/",
    "thumb": "data/thumbs/cookie-clicker-2.png",
    "description": "Cookie Clicker 2 is a fun incremental idle game created by Orteil. Click on the giant cookie to produce cookies and purchase upgrades to automate your cookie empire. Be careful – if you don't manage your resources wisely, your cookie production will stagnate!",
    "controls": "Mouse - Click the cookie to bake. Click - Purchase buildings and upgrades",
    "instructions": "Don't be afraid to wait and save up for the more expensive upgrades that multiply your output. Use the golden cookies you've spotted – clicking them provides temporary massive boosts to production!",
    "creator": "Orteil",
    "category": "Clicker"
  },
  {
    "name": "Drive Mad",
    "slug": "drive-mad",
    "type": "html",
    "url": "https://ubg98.github.io/DriveMad/",
    "thumb": "data/thumbs/drive-mad.png",
    "description": "Drive Mad is a fun car driving game created by Martin Magni. Navigate challenging obstacle courses and reach the finish line without flipping your vehicle or losing your cargo. Be careful – if you drive too fast or tilt too much, your car will crash and you'll have to restart!",
    "controls": "W or Up Arrow - Accelerate. S or Down Arrow - Brake/Reverse. A/D or Left/Right Arrows - Tilt vehicle",
    "instructions": "Don't be afraid to slow down on tricky sections – speed isn't always the answer. Use the vehicle tilting you've mastered to maintain balance over bumps and keep your cargo secure!",
    "creator": "Martin Magni",
    "category": "Racing"
  },
  {
    "name": "G Switch 4",
    "slug": "g-switch-4",
    "type": "html",
    "url": "https://ubg98.github.io/GSwitch4/",
    "thumb": "data/thumbs/g-switch-4.png",
    "description": "G Switch 4 is a fun gravity-switching platformer game created by Serius Games. Run endlessly while flipping gravity to avoid obstacles and stay on the track in this fast-paced action game. Be careful – if you fall off the platform or crash into obstacles, it's game over!",
    "controls": "Player 1: Click, Space, W, Up Arrow, or Z - Switch gravity. Player 2-8: Various keys for multiplayer mode",
    "instructions": "Don't be afraid to switch gravity rapidly when navigating through tight obstacle patterns. Use the rhythm you've developed to anticipate platform gaps and switch gravity at the perfect moment!",
    "creator": "Serius Games",
    "category": "Action"
  },
  {
    "name": "Geometry Jump",
    "slug": "geometry-jump",
    "type": "html",
    "url": "https://ubg98.github.io/GeometryJump/",
    "thumb": "data/thumbs/geometry-jump.png",
    "description": "Geometry Jump is a fun rhythm-based platformer game created by RobTop Games. Jump and fly through dangerous geometric obstacles in sync with the music to reach the end of each level. Be careful – if you hit any obstacle, you'll explode and restart from the last checkpoint!",
    "controls": "Space, W, Up Arrow, or Click - Jump. Hold - Continuous jump (in ship/UFO modes)",
    "instructions": "Don't be afraid to practice difficult sections repeatedly to memorize obstacle patterns. Use the music rhythm you've learned – jumps often sync perfectly with the beat to guide your timing!",
    "creator": "RobTop Games",
    "category": "Action"
  },
  {
    "name": "Heads Arena Soccer All Stars",
    "slug": "heads-arena-soccer-all-stars",
    "type": "html",
    "url": "https://ubg98.github.io/HeadsArenaSoccerAllStars/",
    "thumb": "data/thumbs/heads-arena-soccer-all-stars.png",
    "description": "Heads Arena Soccer All Stars is a fun sports game created by Masiyat Games. Compete in exciting big-head soccer matches and score goals using power-ups and special abilities. Be careful – if your opponent scores more goals before time runs out, you'll lose the match!",
    "controls": "Player 1: WASD - Move, B - Kick/Special. Player 2: Arrow Keys - Move, L - Kick/Special",
    "instructions": "Don't be afraid to collect power-ups during the match – they can turn the game around instantly. Use the special abilities you've unlocked strategically to score amazing goals and defend your net effectively!",
    "creator": "Masiyat Games",
    "category": "Sports"
  },
  {
    "name": "Iron Snout",
    "slug": "iron-snout",
    "type": "html",
    "url": "https://ubg98.github.io/IronSnout/",
    "thumb": "data/thumbs/iron-snout.png",
    "description": "Iron Snout is a fun fighting game created by SnoutUp. Play as a fearless pig and defeat waves of attacking wolves using fast-paced martial arts moves. Be careful – if the wolves overwhelm you with their weapons and attacks, you'll be defeated!",
    "controls": "Arrow Keys or WASD - Punch and kick in different directions. No jump button - Use directional attacks to counter enemies",
    "instructions": "Don't be afraid to catch enemy weapons mid-air and throw them back for extra damage. Use the attack combinations you've discovered to juggle multiple wolves and control the battlefield!",
    "creator": "SnoutUp",
    "category": "Action"
  },
  {
    "name": "Little Alchemy 2",
    "slug": "little-alchemy-2",
    "type": "html",
    "url": "https://ubg98.github.io/LittleAlchemy2/",
    "thumb": "data/thumbs/little-alchemy-2.png",
    "description": "Little Alchemy 2 is a fun crafting puzzle game created by Recloak. Combine basic elements like fire, water, earth, and air to discover hundreds of new items and unlock the secrets of creation. Be careful – if you don't experiment enough, you'll miss discovering rare and complex elements!",
    "controls": "Mouse - Drag and drop elements to combine. Click - Select elements from your inventory",
    "instructions": "Don't be afraid to try unusual combinations – sometimes the most unexpected pairings create new items. Use the hints system you've unlocked if you get stuck, and try combining new discoveries with basic elements!",
    "creator": "Recloak",
    "category": "Puzzle"
  },
  {
    "name": "Mr Bullet",
    "slug": "mr-bullet",
    "type": "html",
    "url": "https://ubg98.github.io/MrBullet/",
    "thumb": "data/thumbs/mr-bullet.png",
    "description": "Mr Bullet is a fun physics puzzle shooter game created by Lion Studios. Aim carefully and shoot bullets to eliminate all enemies and hostages in each level using ricochets and clever angles. Be careful – if you run out of bullets or hit innocent people, you'll fail the level!",
    "controls": "Mouse - Aim your gun. Click - Shoot",
    "instructions": "Don't be afraid to use walls and objects to ricochet bullets toward hidden enemies. Use the bullet trajectory you've learned to plan shots that eliminate multiple targets with one bullet!",
    "creator": "Lion Studios",
    "category": "Puzzle"
  },
  {
    "name": "Papa Cherry Saga",
    "slug": "papa-cherry-saga",
    "type": "html",
    "url": "https://ubg98.github.io/PapaCherrySaga/",
    "thumb": "data/thumbs/papa-cherry-saga.png",
    "description": "Papa Cherry Saga is a fun match-3 puzzle game created by Agame. Match colorful fruits and complete objectives across hundreds of sweet levels in this delicious puzzle adventure. Be careful – if you run out of moves before completing the goal, you'll have to retry the level!",
    "controls": "Mouse - Click and drag to swap fruits. Swipe - Match three or more identical fruits",
    "instructions": "Don't be afraid to create special combos by matching four or more fruits for powerful effects. Use the boosters you've earned strategically on difficult levels to clear tricky obstacles and reach your goals!",
    "creator": "Agame",
    "category": "Puzzle"
  },
  {
    "name": "Rusher Crusher",
    "slug": "rusher-crusher",
    "type": "html",
    "url": "https://ubg98.github.io/RusherCrusher/",
    "thumb": "data/thumbs/rusher-crusher.png",
    "description": "Rusher Crusher is a fun tower defense game created by Kizi. Build towers and defenses to stop waves of enemies rushing toward your base. Be careful – if enemies break through your defenses, your base will be destroyed and you'll lose!",
    "controls": "Mouse - Select and place towers. Click - Upgrade towers and activate abilities",
    "instructions": "Don't be afraid to mix different tower types for maximum effectiveness. Use the strategic positioning you've learned to create chokepoints and maximize your damage output!",
    "creator": "Kizi",
    "category": "Strategy"
  },
  {
    "name": "Space Bar Clicker",
    "slug": "space-bar-clicker",
    "type": "html",
    "url": "https://ubg98.github.io/SpaceBarClicker/",
    "thumb": "data/thumbs/space-bar-clicker.png",
    "description": "Space Bar Clicker is a fun incremental clicker game. Press the spacebar repeatedly to generate points and purchase upgrades to automate your clicking empire. Be careful – if you don't invest in upgrades wisely, your progress will slow down!",
    "controls": "Space Bar - Click to generate points. Mouse - Purchase upgrades and automation",
    "instructions": "Don't be afraid to save up for expensive multiplier upgrades that boost your overall production. Use the auto-clicker upgrades you've unlocked to generate points even when you're not actively clicking!",
    "creator": "Various Developers",
    "category": "Clicker"
  },
  {
    "name": "Stick Merge 2",
    "slug": "stick-merge-2",
    "type": "html",
    "url": "https://ubg98.github.io/StickMerge2/",
    "thumb": "data/thumbs/stick-merge-2.png",
    "description": "Stick Merge 2 is a fun idle merge game created by TinyDobbins. Combine stickman warriors to create stronger fighters and defend your base against endless enemy waves. Be careful – if enemies break through your defenses, your base will take damage and you'll lose!",
    "controls": "Mouse - Drag and drop units to merge. Click - Purchase new units and upgrades",
    "instructions": "Don't be afraid to save up currency for higher-tier units rather than spamming low-level warriors. Use the merge combinations you've discovered to create powerful units efficiently and maximize your defensive strength!",
    "creator": "TinyDobbins",
    "category": "Strategy"
  },
  {
    "name": "Subway Surfers",
    "slug": "subway-surfers",
    "type": "html",
    "url": "https://ubg98.github.io/SubwaySurfers/",
    "thumb": "data/thumbs/subway-surfers.png",
    "description": "Subway Surfers is a fun endless runner game created by Kiloo and SYBO Games. Run through subway tracks, dodge trains, and collect coins while escaping from the grumpy inspector and his dog. Be careful – if you crash into obstacles or get caught, your run ends!",
    "controls": "Arrow Keys or WASD - Move left/right, jump, and roll. Space - Activate hoverboard",
    "instructions": "Don't be afraid to use your hoverboard when things get too intense – it gives you a second chance. Use the power-ups you've collected like jetpacks and magnets to maximize your coin collection and survive longer!",
    "creator": "Kiloo and SYBO Games",
    "category": "Action"
  },
  {
    "name": "Super Mario Wonder",
    "slug": "super-mario-wonder",
    "type": "html",
    "url": "https://ubg98.github.io/SuperMarioWonder/",
    "thumb": "data/thumbs/super-mario-wonder.png",
    "description": "Super Mario Wonder is a fun platformer game inspired by Nintendo's iconic Super Mario series. Jump through colorful levels, collect power-ups, and defeat enemies on your quest to save the kingdom. Be careful – if you fall into pits or take too many hits from enemies, you'll lose a life!",
    "controls": "Arrow Keys - Move left and right. Space or Up Arrow - Jump. Double tap direction - Run",
    "instructions": "Don't be afraid to explore every corner of the level to find hidden power-ups and bonus areas. Use the power-ups you've collected strategically to overcome difficult enemy formations and platforming challenges!",
    "creator": "Fan-made tribute",
    "category": "Adventure"
  },
  {
    "name": "Tag",
    "slug": "tag",
    "type": "html",
    "url": "https://ubg98.github.io/Tag/",
    "thumb": "data/thumbs/tag.png",
    "description": "Tag is a fun multiplayer chasing game created by Pelican Party Studios. Run around the arena trying to avoid being tagged while chasing other players when you're it. Be careful – if you get tagged, you'll become the chaser and need to catch someone else quickly!",
    "controls": "Arrow Keys or WASD - Move your character. Mouse - Control camera angle (in 3D mode)",
    "instructions": "Don't be afraid to use obstacles and corners to your advantage when being chased. Use the movement patterns you've learned to predict where other players will run and cut them off when you're it!",
    "creator": "Pelican Party Studios",
    "category": "Casual"
  },
  {
    "name": "Vex 8",
    "slug": "vex-8",
    "type": "html",
    "url": "https://ubg98.github.io/Vex8/",
    "thumb": "data/thumbs/vex-8.png",
    "description": "Vex 8 is a fun parkour platformer game created by Amazing Adam. Navigate through deadly obstacle courses filled with spikes, blades, and traps using precise movements and acrobatic skills. Be careful – if you touch any hazard, you'll respawn at the last checkpoint!",
    "controls": "Arrow Keys or WASD - Move and jump. S or Down Arrow - Slide",
    "instructions": "Don't be afraid to take your time on difficult sections – rushing often leads to mistakes. Use the wall-jumping and sliding techniques you've mastered to navigate through tight spaces and avoid deadly traps!",
    "creator": "Amazing Adam",
    "category": "Action"
  },
  {
    "name": "Ball Sort Halloween",
    "slug": "ball-sort-halloween",
    "type": "html",
    "url": "https://ubg98.github.io/BallSortHalloween/",
    "thumb": "data/thumbs/ball-sort-halloween.png",
    "description": "Ball Sort Halloween is a fun puzzle sorting game created by IEC Global Pty Ltd. Sort colored balls into tubes until each tube contains only one color in this spooky Halloween-themed brain teaser. Be careful – if you make too many wrong moves, you'll run out of space and get stuck!",
    "controls": "Mouse - Click on a tube to select a ball. Click - Click another tube to move the ball",
    "instructions": "Don't be afraid to use empty tubes as temporary storage while reorganizing your colors. Use the undo button you've discovered if you make a mistake, and plan several moves ahead before committing!",
    "creator": "IEC Global Pty Ltd",
    "category": "Puzzle"
  },
  {
    "name": "Ball Sort Soccer",
    "slug": "ball-sort-soccer",
    "type": "html",
    "url": "https://ubg98.github.io/BallSortSoccer/",
    "thumb": "data/thumbs/ball-sort-soccer.png",
    "description": "Ball Sort Soccer is a fun puzzle sorting game created by IEC Global Pty Ltd. Sort colored soccer balls into tubes until each tube contains only one color in this football-themed brain teaser. Be careful – if you make too many wrong moves, you'll run out of space and get stuck!",
    "controls": "Mouse - Click on a tube to select a ball. Click - Click another tube to move the ball",
    "instructions": "Don't be afraid to use empty tubes strategically as temporary holding spaces while reorganizing. Use the planning strategy you've developed to think multiple moves ahead and avoid getting stuck with unmovable balls!",
    "creator": "IEC Global Pty Ltd",
    "category": "Puzzle"
  },
  {
    "name": "Blumgi Slime",
    "slug": "blumgi-slime",
    "type": "html",
    "url": "https://ubg98.github.io/BlumgiSlime/",
    "thumb": "data/thumbs/blumgi-slime.png",
    "description": "Blumgi Slime is a fun physics platformer game created by Blumgi. Control a bouncy slime and jump through challenging levels to reach the finish flag. Be careful – if you miscalculate your jumps or fall into hazards, you'll have to restart!",
    "controls": "Hold Mouse or Space - Charge jump power. Release - Launch slime. Arrow Keys - Adjust direction mid-air",
    "instructions": "Don't be afraid to experiment with different jump angles and power levels. Use the bounce physics you've learned to navigate tricky platforms and reach difficult areas!",
    "creator": "Blumgi",
    "category": "Action"
  },
  {
    "name": "Bouncy Woods",
    "slug": "bouncy-woods",
    "type": "html",
    "url": "https://ubg98.github.io/BouncyWoods/",
    "thumb": "data/thumbs/bouncy-woods.png",
    "description": "Bouncy Woods is a fun arcade platformer game created by Neutronized. Guide a bouncing ball through dangerous forest environments while avoiding spikes, pits, and obstacles. Be careful – if you hit hazards or fall off the platforms, you'll have to restart the level!",
    "controls": "Left/Right Arrow Keys or A/D - Move and control bounce direction. Space - Jump (if applicable)",
    "instructions": "Don't be afraid to slow down and control your momentum carefully on narrow platforms. Use the bounce physics you've mastered to predict your trajectory and land safely on moving platforms!",
    "creator": "Neutronized",
    "category": "Action"
  },
  {
    "name": "Chicken Merge",
    "slug": "chicken-merge",
    "type": "html",
    "url": "https://ubg98.github.io/ChickenMerge/",
    "thumb": "data/thumbs/chicken-merge.png",
    "description": "Chicken Merge is a fun merge puzzle game created by Inlogic Software. Combine chickens to create higher-level breeds and build the ultimate poultry farm. Be careful – if you run out of space on your farm grid, you won't be able to place new chickens!",
    "controls": "Mouse - Drag and drop chickens to merge. Click - Select and place chickens on the grid",
    "instructions": "Don't be afraid to plan your grid layout carefully to maximize merging opportunities. Use the chicken evolution chain you've discovered to work toward higher-tier breeds efficiently and clear space on your farm!",
    "creator": "Inlogic Software",
    "category": "Puzzle"
  },
  {
    "name": "Crazy Cars",
    "slug": "crazy-cars",
    "type": "html",
    "url": "https://ubg98.github.io/CrazyCars/",
    "thumb": "data/thumbs/crazy-cars.png",
    "description": "Crazy Cars is a fun racing game created by RHM Interactive. Race through stunning 3D tracks, perform stunts, and compete against opponents to become the ultimate racer. Be careful – if you crash or fall off the track, you'll lose precious time!",
    "controls": "Arrow Keys or WASD - Drive and steer. Space - Brake/Drift. Shift - Nitro boost",
    "instructions": "Don't be afraid to use nitro boosts strategically on straightaways for maximum speed. Use the drifting technique you've learned to take sharp corners without losing momentum!",
    "creator": "RHM Interactive",
    "category": "Racing"
  },
  {
    "name": "Dead Again",
    "slug": "dead-again",
    "type": "html",
    "url": "https://ubg98.github.io/DeadAgain/",
    "thumb": "data/thumbs/dead-again.png",
    "description": "Dead Again is a fun zombie survival shooter game. Fight off waves of undead enemies and survive as long as possible using various weapons. Be careful – if zombies overwhelm you, it's game over!",
    "controls": "WASD - Move. Mouse - Aim. Left Click - Shoot. R - Reload. 1-5 - Switch weapons",
    "instructions": "Don't be afraid to keep moving and kiting zombies to avoid getting surrounded. Use the weapon upgrades you've unlocked to deal with larger hordes more effectively!",
    "creator": "Various Developers",
    "category": "Action"
  },
  {
    "name": "Fruit Ninja",
    "slug": "fruit-ninja",
    "type": "html",
    "url": "https://ubg98.github.io/FruitNinja/",
    "thumb": "data/thumbs/fruit-ninja.png",
    "description": "Fruit Ninja is a fun slicing arcade game created by Halfbrick Studios. Swipe your finger across the screen to slice flying fruits while avoiding bombs in this fast-paced action game. Be careful – if you hit a bomb or miss too many fruits, your game ends!",
    "controls": "Mouse - Swipe across fruits to slice them. Click and Drag - Create slicing motions",
    "instructions": "Don't be afraid to go for combo slices when multiple fruits appear together for bonus points. Use the critical hits you've mastered by slicing fruits precisely in the center for maximum score!",
    "creator": "Halfbrick Studios",
    "category": "Casual"
  },
  {
    "name": "Hanger",
    "slug": "hanger",
    "type": "html",
    "url": "https://ubg98.github.io/Hanger/",
    "thumb": "data/thumbs/hanger.png",
    "description": "Hanger is a fun physics-based swinging game created by A Small Game. Swing through levels using your grappling hook while trying to keep as many body parts intact as possible. Be careful – if you hit obstacles or swing too close to walls, you'll lose limbs and mobility!",
    "controls": "Click or Space - Launch grappling hook. Hold - Maintain rope connection. Release - Let go and swing freely",
    "instructions": "Don't be afraid to release your rope early to avoid dangerous obstacles ahead. Use the momentum and swing physics you've learned to build speed and clear large gaps without hitting hazards!",
    "creator": "A Small Game",
    "category": "Action"
  },
  {
    "name": "Head Soccer 2023",
    "slug": "head-soccer-2023",
    "type": "html",
    "url": "https://ubg98.github.io/HeadSoccer2023/",
    "thumb": "data/thumbs/head-soccer-2023.png",
    "description": "Head Soccer 2023 is a fun arcade soccer game created by D&D Dream. Compete in fast-paced matches with big-headed characters and score goals using powerful kicks and special abilities. Be careful – if your opponent scores more goals before time runs out, you'll lose the match!",
    "controls": "Arrow Keys - Move your character. Space - Kick/Use special ability. (Two-player mode available with different key bindings)",
    "instructions": "Don't be afraid to use power-ups that appear on the field to gain an advantage. Use the special abilities you've unlocked strategically – timing your power shot can score incredible goals and block enemy attacks!",
    "creator": "D&D Dream",
    "category": "Sports"
  },
  {
    "name": "Infinite Soccer",
    "slug": "infinite-soccer",
    "type": "html",
    "url": "https://ubg98.github.io/InfiniteSoccer/",
    "thumb": "data/thumbs/infinite-soccer.png",
    "description": "Infinite Soccer is a fun endless soccer game. Score as many goals as possible in this fast-paced football challenge. Be careful – if you miss too many shots, your streak will end!",
    "controls": "Mouse - Aim your shot. Click - Shoot the ball. Arrow Keys - Adjust position",
    "instructions": "Don't be afraid to take your time aiming for the corners of the goal. Use the shooting patterns you've developed to consistently score and build high streaks!",
    "creator": "Various Developers",
    "category": "Sports"
  },
  {
    "name": "Marbles Sorting",
    "slug": "marbles-sorting",
    "type": "html",
    "url": "https://ubg98.github.io/MarblesSorting/",
    "thumb": "data/thumbs/marbles-sorting.png",
    "description": "Marbles Sorting is a fun puzzle sorting game created by Inlogic Software. Sort colored marbles into tubes until each tube contains only one color in this relaxing brain teaser. Be careful – if you make too many wrong moves, you'll run out of space and get stuck!",
    "controls": "Mouse - Click on a tube to select a marble. Click - Click another tube to move the marble",
    "instructions": "Don't be afraid to use empty tubes as temporary storage while reorganizing your colors. Use the strategic thinking you've developed to plan several moves ahead and avoid creating unsolvable situations!",
    "creator": "Inlogic Software",
    "category": "Puzzle"
  },
  {
    "name": "Monkey Mart",
    "slug": "monkey-mart",
    "type": "html",
    "url": "https://ubg98.github.io/MonkeyMar/",
    "thumb": "data/thumbs/monkey-mart.png",
    "description": "Monkey Mart is a fun management simulation game created by TinyDobbins. Run your own supermarket as a cute monkey, plant crops, stock shelves, and serve customers to grow your business. Be careful – if you don't manage your time well or keep shelves stocked, customers will leave unhappy!",
    "controls": "WASD or Arrow Keys - Move your monkey. Space - Interact with stations and harvest crops",
    "instructions": "Don't be afraid to upgrade your stations early to handle customer demand more efficiently. Use the employee system you've unlocked to hire worker monkeys who can help stock shelves and harvest crops automatically!",
    "creator": "TinyDobbins",
    "category": "Simulation"
  },
  {
    "name": "Pou",
    "slug": "pou",
    "type": "html",
    "url": "https://ubg98.github.io/Pou/",
    "thumb": "data/thumbs/pou.png",
    "description": "Pou is a fun virtual pet game created by Zakeh. Take care of your adorable alien pet by feeding, cleaning, and playing with it to keep it happy and healthy. Be careful – if you neglect Pou's needs, it will become sad and dirty!",
    "controls": "Mouse - Click to interact with Pou. Click - Feed, clean, and play with your pet. Drag - Apply items and accessories",
    "instructions": "Don't be afraid to check on Pou regularly throughout the day to maintain its health and happiness. Use the coins you've earned from mini-games to buy food, potions, and outfits to customize your Pou!",
    "creator": "Zakeh",
    "category": "Casual"
  },
  {
    "name": "Roper",
    "slug": "roper",
    "type": "html",
    "url": "https://ubg98.github.io/Roper/",
    "thumb": "data/thumbs/roper.png",
    "description": "Roper is a fun physics-based platformer game. Swing through challenging levels using your rope while collecting gems and avoiding obstacles. Be careful – if you fall or hit hazards, you'll have to restart!",
    "controls": "Mouse - Aim and shoot rope. Click - Attach to surfaces. Release - Let go and swing",
    "instructions": "Don't be afraid to use momentum to swing across large gaps. Use the rope physics you've mastered to control your trajectory and reach difficult platforms!",
    "creator": "Various Developers",
    "category": "Action"
  },
  {
    "name": "Super Liquid Soccer",
    "slug": "super-liquid-soccer",
    "type": "html",
    "url": "https://ubg98.github.io/SuperLiquidSoccer/",
    "thumb": "data/thumbs/super-liquid-soccer.png",
    "description": "Super Liquid Soccer is a fun physics-based soccer game created by Shoe The Goose. Control liquid blob players in hilarious soccer matches where physics and chaos reign supreme. Be careful – if you can't control your wobbly player, your opponent will score easily!",
    "controls": "Player 1: Arrow Keys - Move and jump. Player 2: WASD - Move and jump. (Single player mode available against CPU)",
    "instructions": "Don't be afraid to use the unpredictable bounces to your advantage when shooting. Use the momentum and weight physics you've learned to position your blob effectively and make powerful shots!",
    "creator": "Shoe The Goose",
    "category": "Sports"
  }
]
}